{"type":{"displayName":"View"},"key":null,"ref":null,"props":{"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":"Revised November 4, 2020"},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":["PLEASE READ THE FOLLOWING PROVISIONS OF THE EULA CAREFULLY BEFORE USING ANY SERVICE PROVIDED BY OR SOFTWARE OWNED BY ",{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"}},"_owner":null,"_store":{}},"TORTE LLC (“",{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"TORTE"},"_owner":null,"_store":{}},"”) AND OPERATED UNDER THE NAME OF ",{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"TORTE"},"_owner":null,"_store":{}}," AND/OR ",{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"TORTEPAY"},"_owner":null,"_store":{}}," (COLLECTIVELY “",{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"TORTE SOFTWARE"},"_owner":null,"_store":{}},"”)."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":"BY ACCEPTING THE OPPORTUNITY TO USE THE TORTE SOFTWARE, AND BY USING THE TORTE SOFTWARE, YOU ARE A USER OF THE TORTE SOFTWARE (“USER”), AND YOU ARE AGREEING TO BE BOUND BY THE TERMS OF THIS LICENSE WITH RESPECT TO THE TORTE SOFTWARE. IF YOU DO NOT AGREE TO THE TERMS OF THIS LICENSE, DO NOT ACCEPT THIS AGREEMENT AND DO NOT USE THE TORTE SOFTWARE."},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"1. Software Service. "},"_owner":null,"_store":{}},"This Agreement describes the terms governing your use of the TORTE SOFTWARE, including related TORTE applications, documentation, and all updates. This Agreement incorporates by reference the TORTE Privacy Policy located at ",{"type":{"displayName":"Text","propTypes":{}},"key":"privacy_onPress","ref":null,"props":{"style":[{"fontWeight":"700"},{"color":"#26B990"}],"children":"https://tortepay.com/privacy.html"},"_owner":null,"_store":{}}]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"2. General. "},"_owner":null,"_store":{}},"The TORTE SOFTWARE includes the software, mobile application, and website under the TORTE name that TORTE provides to USER (along with any documentation and embedded information or data), on any media or in any other form (each of the foregoing being included within the meaning of the TORTE SOFTWARE). The TORTE SOFTWARE is covered by intellectual property rights of TORTE, including but not limited to copyrights and trademarks. Title in the TORTE SOFTWARE, all copies and modifications of it, all datasets necessary for, or derived from its usage, and associated intellectual property rights remain in TORTE, and no rights are granted to USER except for the limited rights in this EULA. Such intellectual property rights are being licensed, and not sold, to USER by TORTE for use by USER strictly under the terms of this EULA. TORTE reserves all rights not expressly granted to USER. The rights granted herein are limited to the intellectual property rights of TORTE in the TORTE SOFTWARE. Except for the license rights granted in this Agreement, no license or other right, is granted to USER under any TORTE intellectual property rights under this Agreement. Even to the extent that USER may own the media on which any component of the TORTE SOFTWARE is recorded (if any), TORTE retains title in and to the TORTE SOFTWARE itself. TORTE grants no license to any intellectual property rights of any third party and makes no representation or warranty that any such intellectual property rights exist or do not exist. "]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"3. License Purpose. "},"_owner":null,"_store":{}},"The license rights under this EULA are for enabling use by USER of the TORTE SOFTWARE for operating the TORTE SOFTWARE, including inputting data related to individuals, menu orders, and payment methods; managing preparation of ordered goods; and managing payment of goods and services (collectively, the “PURPOSE”), and are solely for use by the USER, or an authorized licensee of TORTE of intellectual property rights of the TORTE SOFTWARE. If and when the PURPOSE expires, or a use by USER exceeds the scope of the PURPOSE, the license rights granted to the USER will terminate, if not terminated sooner."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"4. Permitted License Uses and Restrictions. "},"_owner":null,"_store":{}},"This EULA grants to USER a limited, nonexclusive, and nontransferable license to use the TORTE SOFTWARE solely for the PURPOSE. Unless (and only to the extent it is) expressly permitted in this EULA or by applicable law, USER may not copy, decompile, reverse engineer, disassemble, attempt to extract or derive the source code or other code, modify, or create derivative works of the TORTE SOFTWARE or any part thereof. USER may not remove any copyright or other proprietary right designation from the TORTE SOFTWARE or any tangible medium relating to it. USER may not circumvent any technological measures that effectively control access to any portion of the TORTE SOFTWARE. USER may not attempt to scrape, parse or otherwise extract any collection of data embedded within the TORTE SOFTWARE or upon which the TORTE SOFTWARE operates or otherwise processes. "]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"5. Responsibilities. "},"_owner":null,"_store":{}},"USER may not rent, lease, lend, or sublicense the TORTE SOFTWARE to any third party. USER may grant permissions to employees, contractors, or other third parties to use the TORTE SOFTWARE for the PURPOSE if the USER is a designated Administrator within the TORTE SOFTWARE. An Administrator is a USER which is responsible for installation and administration of TORTE SOFTWARE at a Point of Sale. Consumers using TORTE SOFTWARE are not considered Administrators. USER shall only use the TORTE SOFTWARE for lawful purposes and with data, software, hardware, or other property as to which USER is authorized to use."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"6. Data. "},"_owner":null,"_store":{}},"USER agrees that data that USER provides to TORTE for use with the TORTE SOFTWARE (“INPUT DATA”) will be data owned exclusively by USER or the entity that employs USER, which USER or the entity that employs USER obtained lawfully, and which USER and the entity that employs USER are authorized to provide to TORTE for the PURPOSE. Any data that results from any operation performed by the TORTE SOFTWARE, in any form (“OUTPUT DATA”) shall be owned exclusively by TORTE. Notwithstanding the foregoing, USER agrees that TORTE shall be permitted to use, for any and all purposes, the INPUT DATA and the OUTPUT DATA. However, to the extent TORTE publishes any performance information relating to either or both of the INPUT DATA or the OUTPUT DATA, TORTE will take reasonable measures to preserve the identity of USER, the entity that employs USER, and any data identifiable to an individual person as confidential. ",{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"For avoidance of doubt,"},"_owner":null,"_store":{}}," subject to the restrictions of this Section, TORTE is entitled to use the INPUT DATA, the OUTPUT DATA or both, in order to create one or more databases, or other data compilations (with title in all such databases or other data compilations belonging exclusively to TORTE) to support the operation of the TORTE SOFTWARE, or otherwise for use as part of the TORTE SOFTWARE. TORTE may also use the INPUT DATA, THE OUTPUT DATA or both to derive and publish performance data analysis or reports about the TORTE SOFTWARE."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"7. Confidentiality. "},"_owner":null,"_store":{}},"USER agrees that various information (such as electronically stored information) owned by TORTE is confidential information, which may also contain trade secrets, including but not limited to software, data collections, algorithms, file arrangements, or the like. Such confidential information has been collected and generated by TORTE at great expense and in a manner that provides TORTE with a valuable competitive advantage. USER agrees to keep confidential and to not use for any reason other than the PURPOSE any confidential information that USER encounters as a result of use of the TORTE SOFTWARE. Such obligation of confidentiality shall last for as long as the subject information remains confidential and does not become publicly available as a result of an activity by a person other than USER or someone working with USER. No obligation of confidentiality under this Agreement shall exist as to any information that is or becomes public as a whole through no fault of the party receiving such information, or that was in possession of the party receiving such information prior to receipt of the information, having been lawfully obtained and being provable by written records."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"8. Termination. "},"_owner":null,"_store":{}},"This EULA is effective until terminated. Without prejudice to any other rights, TORTE may terminate this Agreement or suspend your license and access to TORTE SOFTWARE with or without prior notice and with or without reasoning at its sole discretion and at any time if you fail to comply with this Agreement. However, the obligations undertaken by USER of at least sections 3, 4, 6, 7, 9 and 10 survive termination. Notwithstanding any earlier termination of this Agreement, USER’s duties under this Agreement expire five (5) years from the date of disclosure of Confidential Information. All rights under this Agreement terminate automatically without notice from TORTE if USER fails to comply with any term(s) of this EULA. Upon the earlier of termination of this EULA, USER shall cease all use of information and intellectual property rights owned by TORTE."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"9. Disclaimer of Warranties. "},"_owner":null,"_store":{}},"USER ACKNOWLEDGES THAT THE TORTE SOFTWARE IS PROVIDED “AS IS”. USER IS SOLELY RESPONSIBLE FOR ALL RISKS ASSOCIATED WITH USE BY USER OF THE TORTE SOFTWARE.  TORTE EXPRESSLY DISCLAIMS ANY AND ALL WARRANTIES (EXPRESS, IMPLIED, OR STATUTORY) THAT MAY ARISE BY THIS AGREEMENT OR USER’S USE OF THE TORTE SOFTWARE, INCLUDING BUT NOT LIMITED TO THOSE OF TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT OF INTELLECTUAL PROPERTY RIGHTS OF ANY THIRD PARTY (WHETHER ARISING FROM A STATUTE, OR OTHERWISE IN LAW, OR FROM A COURSE OF DEALING, OR USAGE OF TRADE).  THESE WARRANTY DISCLAIMERS SHALL SURVIVE ANY TERMINATION OF THIS EULA. TORTE MAKES NO WARRANTY OR OTHER GUARANTEE THAT USE OF THE TORTE SOFTWARE WILL RESULT IN FINANCIAL BENEFITS. USER ACKNOWLEDGES THAT USE OF THE TORTE SOFTWARE INVOLVES CERTAIN RISKS INCLUDING THE POTENTIAL FOR DATA LOSSES OR OTHER FORM OF POTENTIAL ECONOMIC LOSSES."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"10. Limitation of Liability. "},"_owner":null,"_store":{}},"TO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT SHALL TORTE BE LIABLE FOR ANY INCIDENTAL OR CONSEQUENTIAL DAMAGES OR FOR LOSS OF USE, LOST PROFITS, COST OF COVER, LOSS OF DATA, BUSINESS INTERRUPTION, OR FOR ANY OTHER CLAIM, EXPENSE, LIABILITY OR LOSS OTHERWISE ARISING FROM USER’S USE OF THE TORTE SOFTWARE. TORTE SHALL NOT BE RESPONSIBLE, AND USER SHALL INDEMNIFY AND HOLD TORTE HARMLESS, FOR ANY AND ALL CLAIMS ARISING FROM ANY INJURY TO PERSON OR PROPERTY OCCASIONED BY USER’S USE OF THE TORTE SOFTWARE."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"11. Export Control. "},"_owner":null,"_store":{}},"USER may not use or otherwise export or re-export the TORTE SOFTWARE except as authorized by United States law and the laws of the jurisdiction in which the TORTE SOFTWARE was obtained. In particular, but without limitation, the TORTE SOFTWARE may not be exported or re-exported (a) into any U.S. embargoed countries or (b) to anyone on the U.S. Treasury Department’s list of Specially Designated Nationals or the U.S. Department of Commerce Denied Persons List or Entity List. By using the TORTE SOFTWARE, USER represents and warrants that USER is not located in any such country or on any such list."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"12. Government End Users. "},"_owner":null,"_store":{}},"The TORTE SOFTWARE and related documentation are “Commercial Items,” as defined at 48 C.F.R. §2.101, consisting of “Commercial Computer Software” and “Commercial Computer Software Documentation,” as such terms are used in 48 C.F.R. §12.212 or 48 C.F.R. §227.7202, as applicable. Consistent with 48 C.F.R. §12.212 or 48 C.F.R. §227.72021 through 227.72024, as applicable, the Commercial Computer Software and Commercial Computer Software Documentation are being licensed to U.S. Government end users (a) only as Commercial Items and (b) with only those rights as are granted to all other end users pursuant to the terms and conditions herein. Unpublished rights are reserved under United States copyright laws. "]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"13. Controlling Law and Severability. "},"_owner":null,"_store":{}},"This Agreement shall be interpreted under and governed by the laws of Massachusetts, without effect to its doctrine of conflict of laws. If for any reason a court of competent jurisdiction finds any provision, or portion thereof, to be unenforceable, the rest of this Agreement shall continue in full force and effect."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"14. Entire Agreement. "},"_owner":null,"_store":{}},"This EULA contains the entire understanding and agreement of USER and TORTE with respect to this license to use of the TORTE SOFTWARE and supersedes all prior oral and written understandings of USER and TORTE with respect to such license. No waiver, modification or amendment of this EULA shall be binding unless it is in writing, refers to this EULA, and is signed by authorized representatives of both USER (and any employer of USER or principal of USER under whose direction USER acts), and TORTE. Nothing herein shall constitute a waiver of any rights TORTE may have against USER, and any failure of TORTE to take action for violations of this Agreement shall not constitute a waiver by TORTE of any rights it may have under this EULA. "]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"15. Third Party Beneficiaries. "},"_owner":null,"_store":{}},"This EULA is executed between USER and TORTE and not between USER and any other party, including Apple for iOS users and Google for Android users. USER agrees that any claims brought by USER arising out of this EULA or USER’s use of the TORTE SOFTWARE will not be made against Apple or Google, as applicable. Notwithstanding the foregoing, upon USER’s acceptance of this EULA, allows Apple or Google, as applicable, to enforce this EULA against USER as a third-party beneficiary thereof. TORTE is not responsible for any applicable third-party agreement between USER and any third-party, including your wireless provider and network provider."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"16. No Included Maintenance and Support. "},"_owner":null,"_store":{}},"TORTE may deploy changes, updates, or enhancements to the TORTE SOFTWARE at any time. TORTE may provide maintenance and support for the TORTE SOFTWARE but has no obligation whatsoever to furnish such services to USER under this agreement and may terminate such services at any time without notice. USER acknowledges that no other party, including Apple for iOS users and Google for Android users, has any obligation to furnish any maintenance or support services in connection with the TORTE SOFTWARE."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"17. Changes to this EULA. "},"_owner":null,"_store":{}},"TORTE reserves the right to modify this EULA at any time and for any reason. TORTE will post the most current version of this EULA at ",{"type":{"displayName":"Text","propTypes":{}},"key":"eula_onPress","ref":null,"props":{"style":[{"fontWeight":"700"},{"color":"#26B990"}],"children":"https://tortepay.com/eula.html#diner"},"_owner":null,"_store":{}},". If TORTE makes material changes to this EULA, USER will receive notification via at least one of the application, website, or email. Notwithstanding the foregoing, USER is responsible for complying with the updated terms posted online on the TORTE SOFTWARE website, even if these updated terms appear online on the website associated with the TORTE SOFTWARE before being posted on the application associated with the TORTE SOFTWARE. USER’s continued use of the TORTE SOFTWARE after TORTE publishes notice of changes to this EULA indicates USER consents to the updated terms."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"18. Consent to Electronic Communications and Solicitation. "},"_owner":null,"_store":{}},"By using the TORTE SOFTWARE as a USER, USER authorizes TORTE to send USER (including via email and push notifications) information regarding the TORTE SOFTWARE, such as: (a) notices about USER’s use of the TORTE SOFTWARE, including notices of violations of use; (b) updates to the TORTE SOFTWARE and new features or products of TORTE SOFTWARE and/or TORTE; and (c) promotional information and materials regarding TORTE’s products and services. "]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"19. Feedback. "},"_owner":null,"_store":{}},"USER may report flaws, errors, or imperfections discovered in any software or other materials where USER has been granted access to the TORTE SOFTWARE. USER acknowledges improvements, modifications, and changes arising from or in connection with the USER’s contribution to the TORTE SOFTWARE, remain or become the exclusive property of TORTE."]},"_owner":null,"_store":{}},{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"color":"#FFFFFF","fontSize":16,"fontWeight":"300","marginTop":16},"children":[{"type":{"displayName":"Text","propTypes":{}},"key":null,"ref":null,"props":{"style":{"fontWeight":"700"},"children":"20. Contact Information. "},"_owner":null,"_store":{}},"For any questions regarding this EULA, please contact TORTE the provider of TORTE SOFTWARE by email at ",{"type":{"displayName":"Text","propTypes":{}},"key":"feedback_onPress","ref":null,"props":{"style":[{"fontWeight":"700"},{"color":"#26B990"}],"children":"feedback@tortepay.com"},"_owner":null,"_store":{}}]},"_owner":null,"_store":{}}]},"_owner":null,"_store":{}}
